app/views/confirm_newsletter/send_confirm_newsletter.html.erb


<% user = User.find_by_email(@email) %>
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "dsmpm@ddqs.fr"], ["LIMIT", 1]]