app/views/weekly_newsletter/send_newsletter.html.erb

</p>
<% user = User.find_by_email(@email) %>
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "sarahbob@thp.com"], ["LIMIT", 1]]