app/controllers/home_controller.rb

    def confirm_newsletter
        @user = User.new
        @user.email = params[:email]
        @user.newsletter = false
        @user.random_string = (0...30).map { ('a'..'z').to_a[rand(26)] }.join
        puts @user.random_string
        @user.save
---
SELECT "users".* FROM "users"
INSERT INTO "users" ("email", "newsletter", "created_at", "updated_at", "random_string") VALUES (?, ?, ?, ?, ?)  [["email", "bobobobo@thp.com"], ["newsletter", 0], ["created_at", "2018-05-17 17:26:19.597922"], ["updated_at", "2018-05-17 17:26:19.597922"], ["random_string", "jyzauyvkjyhrqkzdcxvbpedighdoit"]]

    def send_newsletter
    	@users = User.all
---
SELECT "users".* FROM "users"