app/controllers/user_controller.rb

	def subscribe
        puts ' on est dans subscribe'
        puts params.inspect
        @user = User.find_by(random_string: params[:random_string])
        puts @user.email
        @user.newsletter = true
        @user.save
---
UPDATE "users" SET "newsletter" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["newsletter", 1], ["updated_at", "2018-05-17 17:55:22.869910"], ["id", 40]]