app/controllers/user_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."random_string" = ? LIMIT ?  [["random_string", "cmrrrzctonrdugdryqaotvwwydnfpw"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "newsletter", "created_at", "updated_at", "random_string") VALUES (?, ?, ?, ?, ?)  [["email", "vfv@ligeVd.fr"], ["newsletter", 1], ["created_at", "2018-05-17 16:34:21.228839"], ["updated_at", "2018-05-17 16:34:21.228839"], ["random_string", "rrhscokncnaaxubkuwoqwkzxhnnypt"]]
INSERT INTO "users" ("email", "newsletter", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "{\"email\"=>\"jeanpaul@thp.com\"}"], ["newsletter", 1], ["created_at", "2018-05-17 08:45:09.921339"], ["updated_at", "2018-05-17 08:45:09.921339"]]
---
	def subscribe

    	@user = User.new
    	@user.email = params[:email]
    	@user.newsletter = true
        @user.random_string = (0...30).map { ('a'..'z').to_a[rand(26)] }.join
        puts @user.random_string
    	@user.save
    	if @user.save

SELECT  "users".* FROM "users" WHERE "users"."random_string" = ? LIMIT ?  [["random_string", "rrhscokncnaaxubkuwoqwkzxhnnypt"], ["LIMIT", 1]]
UPDATE "users" SET "newsletter" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["newsletter", 0], ["updated_at", "2018-05-17 16:40:06.466777"], ["id", 18]]
---
    def unsubscribe

        @user = User.find_by(random_string: params[:random_string])
        @user.newsletter = false
        @user.save